#### Terragrunt Format and Style 🖌`success`
#### Terragrunt Initialization ⚙️`success`
#### Terragrunt Plan 📖`success`
#### Terragrunt Validation 🤖`success`

<details><summary>Show Plan</summary>

```

aws_vpc.this[0]: Refreshing state... [id=vpc-0d94ad3dc3cf9d85c]
aws_route53_zone.this["thesamcro.com"]: Refreshing state... [id=Z0435032UBOTXJWG12IM]
data.aws_partition.current: Reading...
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.kms.data.aws_partition.current: Reading...
module.kms.data.aws_caller_identity.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.kms.data.aws_caller_identity.current: Read complete after 0s [id=147194901644]
data.aws_caller_identity.current: Read complete after 0s [id=147194901644]
data.aws_iam_policy_document.logs_policy: Reading...
data.aws_iam_policy_document.logs_policy: Read complete after 0s [id=703442375]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=289466135]
module.kms.aws_kms_key.this[0]: Refreshing state... [id=ebb6b590-abab-4f1d-ae44-e0d8ac7a78d6]
module.kms.aws_kms_alias.this["workload-dev-kms"]: Refreshing state... [id=alias/workload-dev-kms]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
aws_default_security_group.this[0]: Refreshing state... [id=sg-07db7ad127aca9b9c]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-09f7900d0480aed0a]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-036440546d8eb0c76]
aws_subnet.database[0]: Refreshing state... [id=subnet-07f82beb03d7bffde]
aws_subnet.elasticache[1]: Refreshing state... [id=subnet-05b6742a224a52ca4]
aws_route_table.intra[0]: Refreshing state... [id=rtb-02b3150b7f0134487]
aws_route_table.private[0]: Refreshing state... [id=rtb-0073747fb42ccdab4]
aws_subnet.public[2]: Refreshing state... [id=subnet-0818b77399efcd5c4]
aws_route_table.public[0]: Refreshing state... [id=rtb-005957174f54f5c6d]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-014282ca4ee0f3cc9]
aws_subnet.database[1]: Refreshing state... [id=subnet-0e860086d864e835b]
aws_subnet.public[0]: Refreshing state... [id=subnet-07cc71c8ccae57316]
aws_subnet.database[2]: Refreshing state... [id=subnet-074bc37e376762f61]
aws_subnet.public[1]: Refreshing state... [id=subnet-06bd693a610ba1902]
aws_subnet.private[2]: Refreshing state... [id=subnet-08c7c8dc742580a6e]
aws_subnet.private[0]: Refreshing state... [id=subnet-0968647d51820050b]
aws_subnet.intra[1]: Refreshing state... [id=subnet-0774a9993f282be47]
aws_subnet.intra[0]: Refreshing state... [id=subnet-08025e2875063d26a]
aws_subnet.intra[2]: Refreshing state... [id=subnet-08f921e6f93fb0cf1]
aws_subnet.private[1]: Refreshing state... [id=subnet-0c922c6a98dcf1e3b]
aws_subnet.elasticache[2]: Refreshing state... [id=subnet-0088ad809ee5b3403]
aws_subnet.elasticache[0]: Refreshing state... [id=subnet-0c3c69ac30e11c89f]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-005957174f54f5c6d1080289494]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01739f9831d365050]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-064aae29ec5049a56]
aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c1cb8940e30a7de4]
aws_db_subnet_group.database[0]: Refreshing state... [id=workload-dev-vpc-mgmt]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b588fcc72e3cd5f3]
aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0b25a5c2e7acac3b7]
aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0afaa739e879fcf19]
aws_route_table_association.elasticache[2]: Refreshing state... [id=rtbassoc-0514f259df0291c8c]
aws_route_table_association.elasticache[1]: Refreshing state... [id=rtbassoc-0e0fa97f2b47a0523]
aws_route_table_association.elasticache[0]: Refreshing state... [id=rtbassoc-0d70e5ca572ad792c]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0787749d2487d9d0a]
aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-022d09dc2441c5a1b]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f4adf4b730a8d5ea]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0790709fe9bd34646]
aws_elasticache_subnet_group.elasticache[0]: Refreshing state... [id=workload-dev-vpc-mgmt]
aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-058b86eb04bd04e8f]
aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-002c1bae3d4abe7c5]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.wrapper["thesamcro.com"].aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-1:147194901644:certificate/ec2e56c8-2a4a-45bd-baad-c5b494916641]
module.wrapper["thesamcro.com"].aws_route53_record.validation[0]: Refreshing state... [id=Z0435032UBOTXJWG12IM__f969685d8ee6d9edd3fbc1913b71a280.thesamcro.com._CNAME]
aws_cloudwatch_log_group.ecs: Refreshing state... [id=/aws/ecs/workload-dev-ecs-cluster-fargate]
module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:147194901644:cluster/workload-dev-ecs-cluster-fargate]
module.ecs.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=workload-dev-ecs-cluster-fargate]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_cloudwatch_log_group.ecs has been deleted
  - resource "aws_cloudwatch_log_group" "ecs" {
        id                = "/aws/ecs/workload-dev-ecs-cluster-fargate"
      - name              = "/aws/ecs/workload-dev-ecs-cluster-fargate" -> null
        tags              = {
            "Name" = "workload-dev-ecs-cluster-fargate"
        }
        # (4 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_cluster.this[0] has been deleted
  - resource "aws_ecs_cluster" "this" {
      - arn                = "arn:aws:ecs:us-east-1:147194901644:cluster/workload-dev-ecs-cluster-fargate" -> null
      - id                 = "arn:aws:ecs:us-east-1:147194901644:cluster/workload-dev-ecs-cluster-fargate" -> null
      - name               = "workload-dev-ecs-cluster-fargate" -> null
        tags               = {
            "Name" = "workload-dev-ecs-cluster-fargate"
        }
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.this[0] has been deleted
  - resource "aws_ecs_cluster_capacity_providers" "this" {
      - capacity_providers = [
          - "FARGATE_SPOT",
        ] -> null
      - cluster_name       = "workload-dev-ecs-cluster-fargate" -> null
      - id                 = "workload-dev-ecs-cluster-fargate" -> null

      - default_capacity_provider_strategy {
          - base              = 0 -> null
          - capacity_provider = "FARGATE_SPOT" -> null
          - weight            = 100 -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.ecs will be created
  + resource "aws_cloudwatch_log_group" "ecs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "ebb6b590-abab-4f1d-ae44-e0d8ac7a78d6"
      + name              = "/aws/ecs/workload-dev-ecs-cluster-fargate"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "workload-dev-ecs-cluster-fargate"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "workload-dev-ecs-cluster-fargate"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
    }

  # module.ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "workload-dev-ecs-cluster-fargate"
      + tags               = {
          + "Name" = "workload-dev-ecs-cluster-fargate"
        }
      + tags_all           = {
          + "Environment" = "dev"
          + "Name"        = "workload-dev-ecs-cluster-fargate"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }

      + configuration {
          + execute_command_configuration {
              + kms_key_id = "ebb6b590-abab-4f1d-ae44-e0d8ac7a78d6"
              + logging    = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_encryption_enabled = true
                  + cloud_watch_log_group_name     = "/aws/ecs/workload-dev-ecs-cluster-fargate"
                }
            }
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "disabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "workload-dev-ecs-cluster-fargate"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 100
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cluster_arn                = "arn:aws:ecs:us-east-1:147194901644:cluster/workload-dev-ecs-cluster-fargate" -> (known after apply)
  ~ cluster_capacity_providers = {
      - workload-dev-ecs-cluster-fargate = {
          - capacity_providers                 = [
              - "FARGATE_SPOT",
            ]
          - cluster_name                       = "workload-dev-ecs-cluster-fargate"
          - default_capacity_provider_strategy = [
              - {
                  - base              = 0
                  - capacity_provider = "FARGATE_SPOT"
                  - weight            = 100
                },
            ]
          - id                                 = "workload-dev-ecs-cluster-fargate"
        }
    } -> (known after apply)
  ~ cluster_id                 = "arn:aws:ecs:us-east-1:147194901644:cluster/workload-dev-ecs-cluster-fargate" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
module.wrapper["thesamcro.com"].aws_acm_certificate_validation.this[0]: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

</details>

*Pushed by: @obstaclex, Action: `pull_request`, Working Directory: `workload`, Workflow: `Terragrunt CI/CD pipeline`*